app/controllers/restaurantes_controller.rb

SELECT `restaurantes`.* FROM `restaurantes`  ORDER BY `restaurantes`.`nome` ASC
---
	def index
 		@restaurantes = Restaurante.order :nome

SELECT  `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 1 LIMIT 1
---
	def show
		@restaurante = Restaurante.find(params[:id])

INSERT INTO `restaurantes` (`nome`, `endereco`, `especialidade`, `created_at`, `updated_at`) VALUES ('Teste1', 'teste1', 'tEste1', '2016-07-07 22:18:30', '2016-07-07 22:18:30')
---
	def create
		@restaurante = Restaurante.new restaurante_params
		if @restaurante.save

SELECT  `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 1 LIMIT 1
---
	def edit
		@restaurante = Restaurante.find(params[:id])

SELECT  `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 4 LIMIT 1
UPDATE `restaurantes` SET `especialidade` = 'tEstE1', `updated_at` = '2016-07-07 22:35:10' WHERE `restaurantes`.`id` = 4
---
	def update
		@restaurante = Restaurante.find(params[:id])
		if @restaurante.update_attributes(restaurante_params)